# GetDividedSurfaceForReference Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..GetDividedSurfaceForReference Method
DividedSurface Class See Also
---
Get a divided surface for a given reference. Returns null if the reference does not host a divided surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static DividedSurface GetDividedSurfaceForReference(
	Document document,
	Reference faceReference
)
```

Visual Basic
---
```text
Public Shared Function GetDividedSurfaceForReference ( _
	document As Document, _
	faceReference As Reference _
) As DividedSurface
```

Visual C++
---
```text
public:
static DividedSurface^ GetDividedSurfaceForReference(
	Document^ document,
	Reference^ faceReference
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
faceReference
    Type: Autodesk.Revit.DB..::..Reference Reference that represents a face.
# ### Return Value
The newly created divided surface.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace